#+title: emacs_editor_config
* Exclude some tags from inheritance recursive
#+begin_src emacs-lisp
(setq org-tags-exclude-from-inheritance '("mentee"))
#+end_src

#+RESULTS:
| mentee |
* Make it so I can enter dates the way I write them

I write them like 83-9 for 8:30-9:00
or 13-3 for 13:00-13:30
#+begin_src emacs-lisp
(defun my-date-fixit-get-hour (s)
  "Given something like 8-3 or 123-13 as S, find the hour (8 and 12 respectively) and return it.
   Also used for the post dash part of parsing in some cases"
  (let ((first_one (substring s 0 1)))
    (cond
     ((string= "8" first_one) first_one)
     ((string= "9" first_one) first_one)
     (t (substring s 0 2)))
    ))

(defun my-date-fixit-get-minute (s hour)
  "Given the HOUR it found and the characters (S) following the hour it found, return a list of 
   (MINUTES, CHARS_CONSUMED)"
  (let
      ((min_candidate (substring s (length hour)))
       )
    (cond
     ((= 0 (length min_candidate))
      (list (concat ":" "00") 0))
     ((string= "-" (substring min_candidate 0 1))
      (list (concat ":" "00") 0))
     ((= 1 (length min_candidate))
      (list (concat ":" min_candidate "0") 1))
     ((string= "-" (substring min_candidate 1 2))
      (list (concat ":" (substring min_candidate 0 1) "0") 1))
     (t
      (list (concat ":" (substring min_candidate 0 2)) 2)))))


(defun my-date-fixit (d)
  "Given a string in D like 13-14 or 123-13, return 13:00-14:00, 12:30-13:00 respectively. The code
   assumes that the second time range never happens during the 3am hour"
  (letrec (
	   (from_hour (my-date-fixit-get-hour d))
	   (from_minute (my-date-fixit-get-minute d from_hour))
	   (after_minute (substring d (+ (length from_hour) (cadr from_minute))))
	   (after_dash (substring after_minute 1))
	   (to_hour (if (string= "3" after_dash) (concat from_hour ":30")
		      (if (string= "45" after_dash) (concat from_hour ":45")
			(my-date-fixit-get-hour after_dash))))
	   (to_minute  (if (string= "3" after_dash) (list "" t)
			 (if (string= "45" after_dash) (list "" t) 
			   (my-date-fixit-get-minute after_dash to_hour)))))
    
    (concat "" from_hour (car from_minute) "-" to_hour (car to_minute))
    ))

(defun set-meeting-time ()
  "Given a timestamp that looks like this: <2021-04-22 Thu 133-14> where point is at least before the >,
   convert the 133-14 to 13:30-14:00"
  (interactive)
  (search-forward ">")
  (left-char)
  (set-mark (point))
  (search-backward " ")
  (right-char)
  
  (let ((date_info (buffer-substring (mark) (point))))
    (kill-region (point) (mark))
    (insert (my-date-fixit date_info)))
  (next-line)
  )

;; test to make sure things work after I twiddle the code
(list
 (list 'from_hour (my-date-fixit-get-hour "83-9"))
 (list 'from_minute (my-date-fixit-get-minute "83-9" "8"))
 (list 'after_minute (substring "83-9" (+ 1 1)))
 (list 'after_dash (substring "-9" 1))
 (list 'to_hour (if (string= "3" "9") (concat from_hour ":30")
		  (my-date-fixit-get-hour "9")))
 (list 'result (my-date-fixit "83-9"))
 (list 'misc (my-date-fixit "13-14") (my-date-fixit "133-14")
       (my-date-fixit "13-3"))
 (list 'do-45 (my-date-fixit "13-45"))
 )
#+end_src

#+RESULTS:
| from_hour    |           8 |             |             |
| from_minute  |     (:30 1) |             |             |
| after_minute |          -9 |             |             |
| after_dash   |           9 |             |             |
| to_hour      |           9 |             |             |
| result       |   8:30-9:00 |             |             |
| misc         | 13:00-14:00 | 13:30-14:00 | 13:00-13:30 |
| do-45        | 13:00-13:45 |             |             |

